R2>en
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
R2(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.10
R2(config)#ip dhcp pool R1-LAN
R2(dhcp-config)#network 192.168.10.0 255.255.255.0
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#default-router 192.168.10.1


R1>en
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#int g0/0
R1(config-if)#ip helper-address 10.1.1.2


R2>en
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#ip dhcp pool R3-LAN
R2(dhcp-config)#network 192.168.30.0 255.255.255.0
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#default-router 192.168.30.1
R2(dhcp-config)#exit
R2(config)#int g0/1
R2(config-if)#ip address dhcp
R2(config-if)#no shutdown


R3>en
R3#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)#int g0/0
R3(config-if)#ip helper-address 10.2.2.2


R2(config-if)#exit
R2(config)#exit
R2# show ip dhcp binding